-- Таблица users: пользователи маркетплейса
DROP TABLE IF EXISTS users;

CREATE TABLE users (
    user_id  INTEGER PRIMARY KEY,
    name     TEXT,
    city     TEXT,
    reg_date DATE
);

INSERT INTO users (user_id, name, city, reg_date) VALUES
    (1, 'Ася', 'Москва', '2024-11-27'),
    (2, 'Николай', 'Санкт-Петербург', '2024-06-03'),
    (3, 'Александр Сергеевич', 'Нижний Новгород', '2025-02-08'),
    (4, 'Дарья', 'Казань', '2025-10-28'),
    (5, 'Михаил', 'Новосибирск', '2024-02-19'),
    (6, 'Елена', 'Екатеринбург', '2024-03-15'),
    (7, 'Игорь', 'Москва', '2025-07-02'),
    (8, 'Ольга', 'Санкт-Петербург', '2024-04-06'),
    (9, 'Сергей', 'Нижний Новгород', '2025-01-09'),
    (10, 'Анна', 'Казань', '2025-08-19'),
    (11, 'Павел', 'Новосибирск', '2024-02-29'),
    (12, 'Марина', 'Екатеринбург', '2025-06-03'),
    (13, 'Артём', 'Москва', '2024-08-07'),
    (14, 'Наталья', 'Санкт-Петербург', '2024-02-08'),
    (15, 'Victor', 'Нижний Новгород', '2024-03-29'),
    (16, 'Юлия', 'Казань', '2025-03-20'),
    (17, 'Роман', 'Новосибирск', '2025-03-04'),
    (18, 'Татьяна', 'Екатеринбург', '2024-03-12'),
    (19, 'Максим', 'Москва', '2024-09-03'),
    (20, 'Екатерина', 'Санкт-Петербург', '2024-04-02'),
    (21, 'Алексей', 'Нижний Новгород', '2025-07-18'),
    (22, 'София', 'Казань', '2025-03-10'),
    (23, 'Тимур', 'Новосибирск', '2024-03-01'),
    (24, 'Вера', 'Екатеринбург', '2025-08-02'),
    (25, 'Глеб', 'Москва', '2024-05-06');
